8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/MDR1986BExx/2.0.3/IDE/Keil/SVD/MDR32Fx/MDR1986VE93.svd
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON10</name>
                    <addressOffset>0x00000068</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON11</name>
                    <addressOffset>0x0000006C</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON12</name>
                    <addressOffset>0x00000070</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON13</name>
                    <addressOffset>0x00000074</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON14</name>
                    <addressOffset>0x00000078</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON15</name>
                    <addressOffset>0x0000007C</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON16</name>
                    <addressOffset>0x00000080</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON17</name>
                    <addressOffset>0x00000084</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON18</name>
                    <addressOffset>0x00000088</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON19</name>
                    <addressOffset>0x0000008C</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON20</name>
                    <addressOffset>0x00000090</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON21</name>
                    <addressOffset>0x00000094</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON22</name>
                    <addressOffset>0x00000098</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON23</name>
                    <addressOffset>0x0000009C</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON24</name>
                    <addressOffset>0x000000A0</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON25</name>
                    <addressOffset>0x000000A4</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON26</name>
                    <addressOffset>0x000000A8</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON27</name>
                    <addressOffset>0x000000AC</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON28</name>
                    <addressOffset>0x000000B0</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON29</name>
                    <addressOffset>0x000000B4</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON30</name>
                    <addressOffset>0x000000B8</addressOffset>
                </register>
                <register derivedFrom="BUF_CON00">
                    <name>BUF_CON31</name>
                    <addressOffset>0x000000BC</addressOffset>
                </register>
                <register>
                    <name>INT_RX</name>
                    <addressOffset>0x000000C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INT_RX</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RX</name>
                    <addressOffset>0x000000C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RX</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_TX</name>
                    <addressOffset>0x000000C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INT_TX</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TX</name>
                    <addressOffset>0x000000CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TX</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUF_00_ID</name>
                    <description>CAN Buffer ID Register</description>
                    <addressOffset>0x00000200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EID</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>18</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SID</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUF_00_DLC</name>
                    <description>CAN Buffer DLC Register</description>
                    <addressOffset>0x00000204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001F0F</resetMask>
                    <fields>
                        <field>
                            <name>DLC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTR</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R1</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R0</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSR</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDE</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUF_00_DATAL</name>
                    <description>CAN Buffer Data low Register</description>
                    <addressOffset>0x00000208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DB0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB1</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB2</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB3</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUF_00_DATAH</name>
                    <description>CAN Buffer Data high Register</description>
                    <addressOffset>0x0000020C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DB4</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB5</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB6</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DB7</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_01_ID</name>
                    <addressOffset>0x00000210</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_01_DLC</name>
                    <addressOffset>0x00000214</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_01_DATAL</name>
                    <addressOffset>0x00000218</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_01_DATAH</name>
                    <addressOffset>0x0000021C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_02_ID</name>
                    <addressOffset>0x00000220</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_02_DLC</name>
                    <addressOffset>0x00000224</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_02_DATAL</name>
                    <addressOffset>0x00000228</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_02_DATAH</name>
                    <addressOffset>0x0000022C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_03_ID</name>
                    <addressOffset>0x00000230</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_03_DLC</name>
                    <addressOffset>0x00000234</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_03_DATAL</name>
                    <addressOffset>0x00000238</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_03_DATAH</name>
                    <addressOffset>0x0000023C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_04_ID</name>
                    <addressOffset>0x00000240</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_04_DLC</name>
                    <addressOffset>0x00000244</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_04_DATAL</name>
                    <addressOffset>0x00000248</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_04_DATAH</name>
                    <addressOffset>0x0000024C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_05_ID</name>
                    <addressOffset>0x00000250</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_05_DLC</name>
                    <addressOffset>0x00000254</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_05_DATAL</name>
                    <addressOffset>0x00000258</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_05_DATAH</name>
                    <addressOffset>0x0000025C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_06_ID</name>
                    <addressOffset>0x00000260</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_06_DLC</name>
                    <addressOffset>0x00000264</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_06_DATAL</name>
                    <addressOffset>0x00000268</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_06_DATAH</name>
                    <addressOffset>0x0000026C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_07_ID</name>
                    <addressOffset>0x00000270</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_07_DLC</name>
                    <addressOffset>0x00000274</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_07_DATAL</name>
                    <addressOffset>0x00000278</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_07_DATAH</name>
                    <addressOffset>0x0000027C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_08_ID</name>
                    <addressOffset>0x00000280</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_08_DLC</name>
                    <addressOffset>0x00000284</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_08_DATAL</name>
                    <addressOffset>0x00000288</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_08_DATAH</name>
                    <addressOffset>0x0000028C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_09_ID</name>
                    <addressOffset>0x00000290</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_09_DLC</name>
                    <addressOffset>0x00000294</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_09_DATAL</name>
                    <addressOffset>0x00000298</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_09_DATAH</name>
                    <addressOffset>0x0000029C</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_10_ID</name>
                    <addressOffset>0x000002A0</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_10_DLC</name>
                    <addressOffset>0x000002A4</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_10_DATAL</name>
                    <addressOffset>0x000002A8</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_10_DATAH</name>
                    <addressOffset>0x000002AC</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_11_ID</name>
                    <addressOffset>0x000002B0</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_11_DLC</name>
                    <addressOffset>0x000002B4</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_11_DATAL</name>
                    <addressOffset>0x000002B8</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_11_DATAH</name>
                    <addressOffset>0x000002BC</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_12_ID</name>
                    <addressOffset>0x000002C0</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_12_DLC</name>
                    <addressOffset>0x000002C4</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_12_DATAL</name>
                    <addressOffset>0x000002C8</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_12_DATAH</name>
                    <addressOffset>0x000002CC</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_13_ID</name>
                    <addressOffset>0x000002D0</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_13_DLC</name>
                    <addressOffset>0x000002D4</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_13_DATAL</name>
                    <addressOffset>0x000002D8</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAH">
                    <name>BUF_13_DATAH</name>
                    <addressOffset>0x000002DC</addressOffset>
                </register>
                <register derivedFrom="BUF_00_ID">
                    <name>BUF_14_ID</name>
                    <addressOffset>0x000002E0</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DLC">
                    <name>BUF_14_DLC</name>
                    <addressOffset>0x000002E4</addressOffset>
                </register>
                <register derivedFrom="BUF_00_DATAL">
                    <name>BUF_14_DATAL</name>
                    <addressOffset>0x000002E8</addressOffset>
                </register>
